<?php

return [
    'required' => 'Поле ":attribute" обов\'язкове для заповнення.',
    'max' => [
        'array'   => 'Кількість елементів в полі ":attribute" не повинно перевищувати :max.',
        'file'    => 'Розмір файла в полі ":attribute" не може бути більше ніж :max кілобайт(а).',
        'numeric' => 'Значення поля ":attribute" не може бути більше :max.',
        'string'  => 'Кількість символів в полі ":attribute" не може перевищувати :max.',
    ],
    'min' => [
        'array'   => 'Кількість елементів в полі ":attribute" повинно бути не менше :min.',
        'file'    => 'Розмір файла в полі ":attribute" повинно бути не менше :min кілобайт(а).',
        'numeric' => 'Значення поля ":attribute" повинно бути не менше :min.',
        'string'  => 'Кількість символів в полі ":attribute" повинно бути не менше :min.',
    ],
    'numeric' => 'Значення поля ":attribute" повинно бути числом.',
    'required_if' => 'Поле ":attribute" обов\'язкове для заповнення, коли :other дорівнює :value.',
    'url' => 'Значення поля ":attribute" має невірний формат URL.',
    'file' => 'В полі ":attribute" повинен бути вказаний файл.',
    'mimes' => 'Файл в полі ":attribute" повинен бути одного із наступних типів: :values.',

    'attributes' => [
        'resource_name' => 'назва джерела',
        'resource_type' => 'тип джерела',
        'description' => 'опис',
        'year' => 'рік',
        'resource_url' => 'посилання на ресурс',
        'file_path' => 'шлях до файлу',
        'reference_name' => 'назва списку',
        'created_by' => 'ким створено',
        'status' => 'статус',
        'tag_name' => 'назва тегу',
        'username' => 'нікнейм користувача',
        'email' => 'поштова скринька',
        'password' => 'пароль',
        'last_name' => 'прізвище',
        'first_name' => 'ім\'я',
        'patronymic' => 'по-батькові',
        'role' => 'роль'
    ]
];
